Revit 2026 API

# LayeredNdfType Enumeration

---

The enumerated type representing the permitted values for the asset property "LayeredNdfType" from the "AdvancedLayered" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum LayeredNdfType
```
```vb
Public Enumeration LayeredNdfType
```
```cpp
public enum class LayeredNdfType
```
```fsharp
type LayeredNdfType
```

| Member name | Value | Description |
| --- | --- | --- |
| Beckmann | 0 |  |
| Ggx | 1 |  |

#### Reference

Autodesk.Revit.DB.Visual Namespace